---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCProductWrapper.Dispose
source: html/89727a8f-7289-3664-13dd-339402382b29.htm
---
# Autodesk.Revit.DB.IFC.IFCProductWrapper.Dispose Method

Releases all resources used by the IFCProductWrapper

## Syntax (C#)
```csharp
public void Dispose()
```